Tekla Open API Reference for Tekla Structures 2025
CustomLineTypeCatalog.Get Method
 Gets all the available CustomLineType's.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static List<CustomLineType> Get()
Public Shared Function Get As List(Of CustomLineType)
Return Value
Type: List<CustomLineType>
List of CustomLineType's.
See Also
Reference
CustomLineTypeCatalog Class
Get Overload
Tekla.Structures.Drawing Namespace